============
Stray braces
============

<li>{foo}x</li>
<li>{"}" + 4}</li>
<li>{`${`}`}` /* } bar */}</li>
------------------------
(document
  (element
    (start_tag
      (tag_name)
    )
    (expression
      (svelte_raw_text)
    )
    (text)
    (end_tag
      (tag_name)
    )
  )
  (element
    (start_tag
      (tag_name)
    )
    (expression
      (svelte_raw_text)
    )
    (end_tag
      (tag_name)
    )
  )
  (element
    (start_tag
      (tag_name)
    )
    (expression
      (svelte_raw_text)
    )
    (end_tag
      (tag_name)
    )
  )
)

============================
Line comments
============================
<script>
	export let width;
	export let height;
</script>

<svelte:window on:resize={function () {
	// TODO for some reason this.innerWidth doesn't work as the this context is not the window object during test
	width = window.innerWidth, height = window.innerHeight;
}}/>

<div>{width}x{height}</div>
------------------------
(document
  (script_element
    (start_tag (tag_name))
    (raw_text)
    (end_tag (tag_name))
  )
  (element
    (self_closing_tag
      (tag_name)
      (attribute
        (attribute_name
            (attribute_directive)
            (attribute_identifier))
        (expression (svelte_raw_text))
      )
    )
  )
  (element
    (start_tag (tag_name))
    (expression (svelte_raw_text))
    (text)
    (expression (svelte_raw_text))
    (end_tag (tag_name))
  )
)
================
complex test expression
================
<h1>Hello {name + '<>{}``"\'' + "{" + `}}` + {}}!</h1>
----
(document
    (element
    (start_tag
        (tag_name))
    (text)
    (expression (svelte_raw_text))
    (text)
        (end_tag (tag_name))
    )
)
================================
each array with array literal
================================
{#each ["a", "b]}"] as item}
    hello
{/each}

---

(document
  (each_statement
    (each_start
      (block_start_tag)
      (svelte_raw_text)
      (svelte_raw_text)
    )
    (text)
    (each_end
      (block_end_tag)
    )
  )
)


==================================
Attribute expression with newlines
==================================

<img src={{
  src: "foo"
}} alt="A man dances">
----

(document
    (element
        (start_tag (tag_name)
            (attribute
                (attribute_name
                    (attribute_identifier))
               (expression (svelte_raw_text)))
            (attribute
                (attribute_name
                    (attribute_identifier))
                (quoted_attribute_value (attribute_value))))))
